.. _siren_userguide:

SIREN Strings
============

Introduction
------------

The function :func:`clean_fr_siren() <dataprep.clean.clean_fr_siren.clean_fr_siren>` cleans a column containing French personal identification number (SIREN) strings, and standardizes them in a given format. The function :func:`validate_fr_siren() <dataprep.clean.clean_fr_siren.validate_fr_siren>` validates either a single SIREN strings, a column of SIREN strings or a DataFrame of SIREN strings, returning `True` if the value is valid, and `False` otherwise.

SIREN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "552008443"
* `standard`: SIREN strings with proper whitespace in the proper places. Note that in the case of SIREN, the compact format is the same as the standard one.
* `tva`: return a TVA that preposes two extra check digits to the data, like "19 552 008 443".

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_fr_siren()` and `validate_fr_siren()`.

### An example dataset containing SIREN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "siren": [
            '552 008 443',
            '404833047',
            '7542011030',
            '7552A10004',
            '8019010008', 
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

         siren                                           address
0  552 008 443                                     123 Pine Ave.
1    404833047                                           main st
2   7542011030                      1234 west main heights 57033
3   7552A10004                    apt 1 789 s maple rd manhattan
4   8019010008                robie house, 789 north main street
5        hello         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7         NULL                                             hello

## 1. Default `clean_fr_siren`

By default, `clean_fr_siren` will clean siren strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_fr_siren
clean_fr_siren(df, column = "siren")

         siren                                           address siren_clean
0  552 008 443                                     123 Pine Ave.   552008443
1    404833047                                           main st         NaN
2   7542011030                      1234 west main heights 57033         NaN
3   7552A10004                    apt 1 789 s maple rd manhattan         NaN
4   8019010008                robie house, 789 north main street         NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7         NULL                                             hello         NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_fr_siren(df, column = "siren", output_format="standard")

         siren                                           address siren_clean
0  552 008 443                                     123 Pine Ave.   552008443
1    404833047                                           main st         NaN
2   7542011030                      1234 west main heights 57033         NaN
3   7552A10004                    apt 1 789 s maple rd manhattan         NaN
4   8019010008                robie house, 789 north main street         NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7         NULL                                             hello         NaN

### `compact`

In [4]:
clean_fr_siren(df, column = "siren", output_format="compact")

         siren                                           address siren_clean
0  552 008 443                                     123 Pine Ave.   552008443
1    404833047                                           main st         NaN
2   7542011030                      1234 west main heights 57033         NaN
3   7552A10004                    apt 1 789 s maple rd manhattan         NaN
4   8019010008                robie house, 789 north main street         NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7         NULL                                             hello         NaN

### `tva`

In [5]:
clean_fr_siren(df, column = "siren", output_format="tva")

,siren,address,siren_clean
0,552 008 443,123 Pine Ave.,19 552 008 443
1,404833047,main st,NaN
2,7542011030,1234 west main heights 57033,NaN
3,7552A10004,apt 1 789 s maple rd manhattan,NaN
4,8019010008,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned SIREN strings is added with a title in the format `"{original title}_clean"`.

In [6]:
clean_fr_siren(df, column="siren", inplace=True)

  siren_clean                                           address
0   552008443                                     123 Pine Ave.
1         NaN                                           main st
2         NaN                      1234 west main heights 57033
3         NaN                    apt 1 789 s maple rd manhattan
4         NaN                robie house, 789 north main street
5         NaN         1111 S Figueroa St, Los Angeles, CA 90015
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles
7         NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [7]:
clean_fr_siren(df, "siren", errors="coerce")

         siren                                           address siren_clean
0  552 008 443                                     123 Pine Ave.   552008443
1    404833047                                           main st         NaN
2   7542011030                      1234 west main heights 57033         NaN
3   7552A10004                    apt 1 789 s maple rd manhattan         NaN
4   8019010008                robie house, 789 north main street         NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7         NULL                                             hello         NaN

### `ignore`

In [8]:
clean_fr_siren(df, "siren", errors="ignore")

         siren                                           address siren_clean
0  552 008 443                                     123 Pine Ave.   552008443
1    404833047                                           main st   404833047
2   7542011030                      1234 west main heights 57033  7542011030
3   7552A10004                    apt 1 789 s maple rd manhattan  7552A10004
4   8019010008                robie house, 789 north main street  8019010008
5        hello         1111 S Figueroa St, Los Angeles, CA 90015       hello
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7         NULL                                             hello         NaN

## 4. `validate_fr_siren()`

`validate_fr_siren()` returns `True` when the input is a valid SIREN. Otherwise it returns `False`.

The input of `validate_fr_siren()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_fr_siren()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_fr_siren()` returns the validation result for the whole DataFrame.

In [9]:
from dataprep.clean import validate_fr_siren
print(validate_fr_siren('552 008 443'))
print(validate_fr_siren('404833047'))
print(validate_fr_siren('7542011030'))
print(validate_fr_siren('7552A10004'))
print(validate_fr_siren('8019010008'))
print(validate_fr_siren("hello"))
print(validate_fr_siren(np.nan))
print(validate_fr_siren("NULL"))

True
False
False
False
False
False
False
False

### Series

In [10]:
validate_fr_siren(df["siren"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: siren, dtype: bool

### DataFrame + Specify Column

In [11]:
validate_fr_siren(df, column="siren")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: siren, dtype: bool

### Only DataFrame

In [12]:
validate_fr_siren(df)

   siren  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False